#+TITLE: Emacs configuration for C++/CMake/git
#+DESCRIPTION: An Emacs configuration for Clojure/C++ development with orgmode

#+EXPORT_FILE_NAME: index.html
#+HTML_DOCTYPE: html5
#+HTML_LINK_UP: ..
#+HTML_LINK_HOME: ..
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../web/worg.css" />
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
#+HTML_MATHJAX: path: "../MathJax/MathJax.js?config=TeX-AMS_CHTML"
#+OPTIONS: html-style:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: html-scripts:nil
#+OPTIONS: timestamp:nil

** F-Key shortcuts
- magit status
- git gutter
- export to html
- tangle file
- refresh/revert file
- launch REPL
- F12 :: Go to Definition (VS)
- F11 :: Step Into
- F12 :: Step Out
- F10 :: Step Over
- F9 :: Toggle Breakpoint (VS)
- F8 :: Build Selection
- F7 ::
- F5 :: Debug Start
- F3 :: Split Window (Dolphin)
- F4 :: Shell (Dolphin)
#+BEGIN_SRC emacs-lisp :tangle init.el
(global-set-key (kbd "<f2>") 'magit-status)
(global-set-key (kbd "<f3>") 'cider-browse-ns)
(global-set-key (kbd "<f4>") 'eshell)
(setq display-buffer-alist '(("\\`\\*e?shell" display-buffer-use-some-window)))
(global-set-key (kbd "<f5>") 'calendar)
(global-set-key (kbd "<f6>") 'org-babel-tangle)
(global-set-key (kbd "<f7>") 'org-html-export-to-html)
(global-set-key (kbd "<f8>") 'eshell)
(global-set-key (kbd "<f9>") 'cider-jack-in)
(global-set-key (kbd "<f10>") 'cider-xref-fn-refs)
(global-set-key (kbd "<f11>") 'cider-browse-ns-all)
(global-set-key (kbd "<f12>") ''cider-enlighten-mode)
 #+END_SRC

 #+RESULTS:
 | quote | cider-enlighten-mode |

